docs/v21_greedy_bench40.log
INFO 09-02 12:03:00 [__init__.py:52] Available plugins for group vllm.platform_plugins:
INFO 09-02 12:03:00 [__init__.py:54] - ascend -> vllm_ascend:register
INFO 09-02 12:03:00 [__init__.py:57] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
INFO 09-02 12:03:00 [__init__.py:237] Platform plugin ascend is activated
INFO 09-02 12:03:00 [platform.py:62] Breakable cudagraph is force disabled on Ascend because DeepSeek V4 PIECEWISE cudagraph is not supported yet.
/vllm-workspace/vllm-omni/vllm_omni/__init__.py:19: RuntimeWarning: Failed to import version from _version.py: No module named 'vllm_omni._version'
This typically happens in development mode before building.
Using fallback version 'dev'.
  from .version import __version__, __version_tuple__  # isort:skip # noqa: F401
INFO 09-02 12:03:15 [patch.py:252] NVFP4 W4A4 weight_scale NaN-clamp: installed.
INFO 09-02 12:03:15 [patch.py:564] [cumem-cuda] CuMemAllocator._python_free_callback patched: asleep guard extended to all platforms.
INFO 09-02 12:03:19 [main.py:54] Delegating entrypoint handling to vllm-omni
2026-09-02 12:03:19,595 - 6689 - ServiceProfiler - INFO - VLLM_USE_V1 not set, auto-detected via vLLM 0.1.dev1+ge5588e49b.empty: default 0
INFO 09-02 12:03:19 [__init__.py:112] Registered model loader `<class 'vllm_ascend.model_loader.netloader.netloader.ModelNetLoaderElastic'>` with load format `netloader`
INFO 09-02 12:03:19 [__init__.py:112] Registered model loader `<class 'vllm_ascend.model_loader.rfork.rfork_loader.RForkModelLoader'>` with load format `rfork`
TrackingNamespace(subparser='bench', bench_type='serve', dispatch_function=<function OmniBenchmarkServingSubcommand.cmd at 0xfffe7aa849a0>, omni=True, trust_remote_code=True, seed=0, num_prompts=40, dataset_name='seed-tts', no_stream=False, dataset_path='/tmp/seedtts/seedtts_testset', no_oversample=True, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat-omni', base_url=None, host='127.0.0.1', port=8091, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='/workspace/shared_assets/models/OpenBMB/MiniCPM-o-4_5', input_len=None, output_len=None, tokenizer='/workspace/shared_assets/models/OpenBMB/MiniCPM-o-4_5', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=2, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el,audio_ttfp,audio_rtf', metric_percentiles='99', goodput=None, request_id_prefix='bench-54c00597-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body={'modalities': ['text', 'audio'], 'chat_template_kwargs': {'enable_thinking': False, 'use_tts_template': True}}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False, daily_omni_qa_json=None, daily_omni_video_dir=None, daily_omni_inline_local_video=False, daily_omni_input_mode='all', daily_omni_pack_mode='qwen', daily_omni_save_eval_items=False, videomme_parquet=None, videomme_video_dir=None, videomme_subtitle_dir=None, videomme_pack_mode='minicpm-frames', videomme_max_frames=None, videomme_duration='all', videomme_use_subtitle=False, videomme_inline_local_video=False, videomme_save_eval_items=False, seed_tts_locale='zh', seed_tts_turns_per_session=1, seed_tts_root=None, seed_tts_file_ref_audio=False, seed_tts_inline_ref_audio=False, seed_tts_system_prompt=None, seed_tts_wer_eval=True, seed_tts_wer_save_items=True, print_stage=False, bot_task='think')
INFO 09-02 12:03:21 [seed_tts_dataset.py:210] Loaded Seed-TTS: root=/tmp/seedtts/seedtts_testset locale=zh rows=2020 inline_ref_audio=True
INFO 09-02 12:03:22 [seed_tts_dataset.py:283] Seed-TTS: built 40 sessions (asked 40, turns_per_session=1)
INFO 09-02 12:03:22 [datasets.py:309] Skipping oversampling. Total samples: 40.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [00:02<00:00,  1.06s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 40/40 [00:38<00:00,  1.03it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     40        
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  38.97     
Request throughput (req/s):              1.03      
Peak concurrent requests:                3.00      
----------------End-to-end Latency----------------
Mean E2EL (ms):                          973.26    
Median E2EL (ms):                        937.02    
P99 E2EL (ms):                           1243.07   
================== Text Result ===================
Total input tokens:                      5947      
Total generated tokens:                  507       
Output token throughput (tok/s):         13.01     
Peak output token throughput (tok/s):    25.00     
Peak concurrent requests:                3.00      
Total Token throughput (tok/s):          165.60    
---------------Time to First Token----------------
Mean TTFT (ms):                          92.09     
Median TTFT (ms):                        89.45     
P99 TTFT (ms):                           111.19    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          0.00      
Median TPOT (ms):                        0.00      
P99 TPOT (ms):                           0.00      
---------------Inter-token Latency----------------
Mean ITL (ms):                           0.00      
Median ITL (ms):                         0.00      
P99 ITL (ms):                            0.00      
================== Audio Result ==================
Total audio duration generated(s):       183.48    
Total audio frames generated:            4403520   
Audio throughput(audio duration/s):      4.71      
Streaming continuity OK rate:            100.00%   
---------------Time to First Packet---------------
Mean AUDIO_TTFP (ms):                    326.67    
Median AUDIO_TTFP (ms):                  325.30    
P99 AUDIO_TTFP (ms):                     346.41    
-----------------Real Time Factor-----------------
Mean AUDIO_RTF:                          0.21      
Median AUDIO_RTF:                        0.21      
P99 AUDIO_RTF:                           0.27      
==================================================
WARNING 09-02 12:04:06 [seed_tts_eval.py:444] Loading Seed-TTS eval Paraformer 'paraformer-zh' on npu:0 (one-time, seed-tts-eval protocol)...
2026-09-02 12:04:33,065 [INFO] download models from model hub: ms
2026-09-02 12:04:33,661 | INFO    | modelscope_hub.download | Downloading 13 files from iic/speech_seaco_paraformer_large_asr_nat-zh-cn-16k-common-vocab8404-pytorch@master
funasr version: 1.4.4.
Check update of funasr, and it would cost few times. You may disable it by set `disable_update=True` in AutoModel
New version is available: 1.4.13.
Please use the command "pip install -U funasr" to upgrade.
Downloading: 100%|██████████| 13/13 [00:00<00:00, 14.43file/s]
2026-09-02 12:04:34,606 [WARNING] trust_remote_code: False
2026-09-02 12:04:37,326 [INFO] Loading pretrained params from /root/.cache/modelscope/models/iic--speech_seaco_paraformer_large_asr_nat-zh-cn-16k-common-vocab8404-pytorch/snapshots/master/model.pt
2026-09-02 12:04:37,335 [INFO] ckpt: /root/.cache/modelscope/models/iic--speech_seaco_paraformer_large_asr_nat-zh-cn-16k-common-vocab8404-pytorch/snapshots/master/model.pt
2026-09-02 12:04:38,696 [INFO] scope_map: ['module.', 'None']
2026-09-02 12:04:38,696 [INFO] excludes: None
2026-09-02 12:04:38,824 [INFO] Loading ckpt: /root/.cache/modelscope/models/iic--speech_seaco_paraformer_large_asr_nat-zh-cn-16k-common-vocab8404-pytorch/snapshots/master/model.pt, status: <All keys matched successfully>
rtf_avg: 0.254: 100%|██████████| 1/1 [00:01<00:00,  1.31s/it]
2026-09-02 12:04:42,148 [INFO] get env SEED_TTS_SIM_EVAL = 1
WARNING 09-02 12:04:42 [seed_tts_eval.py:252] Loading WavLM 'microsoft/wavlm-base-plus' on npu:0 for Seed-TTS SIM (embedding cosine; not identical to seed-tts-eval UniSpeech SV checkpoint).
2026-09-02 12:04:42,948 [INFO] get env AI_AGENT = github_copilot_vscode_agent
2026-09-02 12:04:42,948 [INFO] get env TERM_PROGRAM = vscode
Loading weights: 100%|██████████| 248/248 [00:00<00:00, 17021.28it/s]
rtf_avg: 0.040: 100%|██████████| 1/1 [00:00<00:00,  4.13it/s]
rtf_avg: 0.045: 100%|██████████| 1/1 [00:00<00:00,  4.42it/s]
rtf_avg: 0.048: 100%|██████████| 1/1 [00:00<00:00,  4.94it/s]
rtf_avg: 0.044: 100%|██████████| 1/1 [00:00<00:00,  4.71it/s]
rtf_avg: 0.046: 100%|██████████| 1/1 [00:00<00:00,  5.02it/s]
rtf_avg: 0.050: 100%|██████████| 1/1 [00:00<00:00,  5.15it/s]
rtf_avg: 0.039: 100%|██████████| 1/1 [00:00<00:00,  6.01it/s]
rtf_avg: 0.040: 100%|██████████| 1/1 [00:00<00:00,  5.94it/s]
rtf_avg: 0.049: 100%|██████████| 1/1 [00:00<00:00,  5.18it/s]
rtf_avg: 0.043: 100%|██████████| 1/1 [00:00<00:00,  4.29it/s]
rtf_avg: 0.053: 100%|██████████| 1/1 [00:00<00:00,  5.16it/s]
rtf_avg: 0.042: 100%|██████████| 1/1 [00:00<00:00,  4.47it/s]
rtf_avg: 0.040: 100%|██████████| 1/1 [00:00<00:00,  5.93it/s]
rtf_avg: 0.046: 100%|██████████| 1/1 [00:00<00:00,  4.86it/s]
rtf_avg: 0.050: 100%|██████████| 1/1 [00:00<00:00,  4.87it/s]
rtf_avg: 0.062: 100%|██████████| 1/1 [00:00<00:00,  3.60it/s]
rtf_avg: 0.053: 100%|██████████| 1/1 [00:00<00:00,  3.22it/s]
rtf_avg: 0.043: 100%|██████████| 1/1 [00:00<00:00,  6.37it/s]
rtf_avg: 0.041: 100%|██████████| 1/1 [00:00<00:00,  4.89it/s]
rtf_avg: 0.063: 100%|██████████| 1/1 [00:00<00:00,  3.56it/s]
rtf_avg: 0.072: 100%|██████████| 1/1 [00:00<00:00,  3.68it/s]
rtf_avg: 0.040: 100%|██████████| 1/1 [00:00<00:00,  5.93it/s]
rtf_avg: 0.070: 100%|██████████| 1/1 [00:00<00:00,  3.57it/s]
rtf_avg: 0.051: 100%|██████████| 1/1 [00:00<00:00,  5.36it/s]
rtf_avg: 0.067: 100%|██████████| 1/1 [00:00<00:00,  3.49it/s]
rtf_avg: 0.040: 100%|██████████| 1/1 [00:00<00:00,  5.59it/s]
rtf_avg: 0.058: 100%|██████████| 1/1 [00:00<00:00,  3.13it/s]
rtf_avg: 0.059: 100%|██████████| 1/1 [00:00<00:00,  3.30it/s]
rtf_avg: 0.052: 100%|██████████| 1/1 [00:00<00:00,  2.97it/s]
rtf_avg: 0.058: 100%|██████████| 1/1 [00:00<00:00,  3.09it/s]
rtf_avg: 0.041: 100%|██████████| 1/1 [00:00<00:00,  5.66it/s]
rtf_avg: 0.073: 100%|██████████| 1/1 [00:00<00:00,  3.62it/s]
rtf_avg: 0.044: 100%|██████████| 1/1 [00:00<00:00,  5.95it/s]
rtf_avg: 0.062: 100%|██████████| 1/1 [00:00<00:00,  3.52it/s]
rtf_avg: 0.063: 100%|██████████| 1/1 [00:00<00:00,  3.48it/s]
rtf_avg: 0.040: 100%|██████████| 1/1 [00:00<00:00,  5.92it/s]
rtf_avg: 0.062: 100%|██████████| 1/1 [00:00<00:00,  3.40it/s]
rtf_avg: 0.037: 100%|██████████| 1/1 [00:00<00:00,  5.57it/s]
rtf_avg: 0.057: 100%|██████████| 1/1 [00:00<00:00,  3.29it/s]
===== Seed-TTS eval (seed-tts-eval protocol) =====
Evaluated (WER, lower is better):        40        
Mean WER:                                0.0076    
Median WER:                              0.0000    
Request failed:                          0         
No PCM captured:                         0         
ASR / WER failed:                        0         
SIM evaluated (higher ~ closer):         40        
Mean SIM:                                0.8404    
Median SIM:                              0.8456    
SIM skipped (no ref path):               0         
SIM embedding errors:                    0         
==================================================